# Decision Tree

In [28]:
# importing libreries
import pandas as pd
df=pd.read_csv("salary.csv")
df.head()

  company                  job     degree  salary_more_then_100k
0  google      sales executive  bachelors                      0
1  google      sales executive    masters                      0
2  google     business manager  bachelors                      1
3  google     business manager    masters                      1
4  google  computer programmer  bachelors                      0

In [29]:
inputs=df.drop('salary_more_then_100k', axis='columns')
target=df.drop(['company','job','degree'],axis='columns')

In [30]:
inputs.head()

  company                  job     degree
0  google      sales executive  bachelors
1  google      sales executive    masters
2  google     business manager  bachelors
3  google     business manager    masters
4  google  computer programmer  bachelors

In [31]:
target.head()

   salary_more_then_100k
0                      0
1                      0
2                      1
3                      1
4                      0

In [32]:
"""machine learning algo works only on numbers ,
so we have to convert this text into numbers """ 
from sklearn.preprocessing import LabelEncoder
ljob=LabelEncoder()
lcompany=LabelEncoder()
ldegree=LabelEncoder()

In [33]:
inputs["ncompany"]=lcompany.fit_transform(inputs["company"])
inputs["njob"]=ljob.fit_transform(inputs["job"])
inputs["ndegree"]=ldegree.fit_transform(inputs["degree"])
inputs.head()

  company                  job     degree  ncompany  njob  ndegree
0  google      sales executive  bachelors         2     2        0
1  google      sales executive    masters         2     2        1
2  google     business manager  bachelors         2     0        0
3  google     business manager    masters         2     0        1
4  google  computer programmer  bachelors         2     1        0

In [35]:
ninputs=inputs.drop(['company','job','degree'],axis='columns')
ninputs.head()

   ncompany  njob  ndegree
0         2     2        0
1         2     2        1
2         2     0        0
3         2     0        1
4         2     1        0

In [38]:
from sklearn.tree import DecisionTreeClassifier
model=DecisionTreeClassifier()

In [39]:
#training model 
model.fit(ninputs,target)

DecisionTreeClassifier()

In [40]:
model.score(ninputs,target)

1.0

In [41]:
# check
model.predict([[2,2,1]])

array([0], dtype=int64)